export const questionsData = [
  {
    text: "Фуқаролик ҳуқуқ лаёқати қачон пайдо бўлади",
    options: ["Инсоннинг туғилиши билан пайдо бўлади", "Инсоннинг вояга етганидан бошлаб", "Фуқаро муомалавий лаёқатга киришганда", "Фуқаро 18 ёшга киргандан бошлаб"],
    answer: 0
  },
  {
    text: "Ҳуқуқ лаёқатининг бошланиши ва тамом бўлиши вақти",
    options: ["Туғилганидан 60 ёшга этгунча", "Туғилганидан то ўлимигачат", "19 ёшга тўлиши билан", "7 ёшдан 70 ёшгача"],
    answer: 1
  },
  {
    text: "Қуйидагилардан қайси бири тўғри?",
    options: ["Барча фуқаролар муомала лаёқатига эга",
       "Фуқаронинг ўз ҳаракатлари билан фуқаролик ҳуқуқларига эга бўлиш ва уларни амалга ошириш, ўзи учун фуқаролик бурчларини вужудга келтириш ва уларни бажариш лаёқати инсоннинг туғилиши билан пайдо бўлади", "Фуқаронинг фуқаролик ҳуқуқ ва бурчларига эга бўлиш лаёқати муомала лаёқати ҳисобланади",
       "Фуқаронинг ўз ҳаракатлари билан фуқаролик ҳуқуқларига эга бўлиш ва уларни амалга ошириш, ўзи учун фуқаролик бурчларини вужудга келтириш ва уларни бажариш лаёқати муомала лаёқати ҳисобланади"],
    answer: 3
  },
  {
    text: "Қуйидагилардан қайси бири нотўғри",
    options: ["Никоҳ ҳақиқий эмас деб топилганида суд вояга етмаган эр (хотин) суд белгилаган пайтдан бошлаб тўла муомала лаёқатини", "Вояга етгунга қадар қонуний асосда никоҳдан ўтган фуқаро никоҳдан ўтган вақтдан эътиборан қисман",
       "Никоҳ тузиш натижасида эга бўлинган муомала лаёқати ўн саккиз ёшга тўлмасдан туриб никоҳ бекор қилинган тақдирда ҳам тўла сақланиб қолади", "Фуқаронинг муомала лаёқати у вояга етгач, яъни ўн саккиз ёшга тўлгач тўла ҳажмда вужудга келади"],
    answer: 1
  },
    {
    text: "Эмансипация неча ёшдан мумкин?",
    options: ["16 ёшдан",
    "17 ёшдан",
    "15 ёшдан",
    "14 ёшдан"],
    answer: 0
  },   
  {
    text: "14 ёшга тўлмаган вояга етмаганлар ота-оналари, фарзандликка олувчилар ва ҳомийларининг розилигисиз қуйидагиларнинг кай бирини мустақил равишда амалга оширишга ҳақли",
    options: ["кредит муассасаларига омонатлар қўйиш ва уларни тасарруф этиш",
    "текин манфаат кўришга қаратилган, нотариал тасдиқлашни ёки давлат рўйхатидан ўтказишни талаб қилмайдиган битимлар",
    "ўз иш ҳақи, стипендияси ва бошқа даромадларини тасарруф этиш",
    "фан, адабиёт ёки санъат асарининг, ихтиронинг ёхуд ўз интеллектуал фаолиятининг қонун билан қўриқланадиган бошқа натижаси муаллифи ҳуқуқини амалга ошириш"],
    answer: 1
  },
   {
    text: "Васийлик қайси ҳолларда қўлланилади",
    options: ["руҳий касал, ақли заифлар, муттасил ичкиликбозлик ёки гиёҳвандликка мубтало бўлган шахслар устидан",
    "18 ёшга тўлмаган вояга етмаганлар устидан ва муттасил ичкиликбозлик ёки гиёҳвандликка мубтало бўлган шахслар устидан",
    "6 ёшга тўлмаган вояга етмаганлар ва руҳий касал, ақли заифлар устидан",
    "14 ёшга тўлмаган вояга етмаганлар устидан ва руҳий касал, ақли заифлар устидан"],
    answer: 3
  },
   {
    text: "Ҳомийлик қайси ҳолларда қўлланилади?",
    options: ["муомалага лаёқатсиз шахслар устидан",
    "муомала лаёқати чекланган шахслар устидан",
    "14 ёшга тўлмаган вояга етмаганлар устидан",
    "6 ёшга тўлмаган шахслар устидан"],
    answer: 1
  },
   {
    text: "Фуқаронинг муомала лаёқати чекланишига сабаб бўлган асосни топинг?",
    options: ["Спиртли ичимликларни ёки гиёҳвандлик воситаларини суиистеъмол қилиш натижасида ўз оиласини оғир моддий аҳволга солиб қўйиш",
    "Руҳий касаллиги ёки ақли заифлиги оқибатида ўз ҳаракатларининг аҳамиятини тушуна олмайдиган ёки уларни бошқара олмаслик",
    "суд томонидан фуқарога васий белгиланиши",
    "Никоҳ тузиш натижасида эга бўлинган муомала лаёқати ўн саккиз ёшга тўлмасдан туриб никоҳ бекор қилинса"],
    answer: 0
  },
   
];
