export const questionsData = [
  {
    text: "Столица Узбекистана?",
    options: ["Нукус", "Ташкент", "Самарканд", "Бухара"],
    answer: 1
  },
  {
    text: "Ҳуқуқ лаёқатининг бошланиши ва тамом бўлиши вақти",
    options: ["Туғилганидан 60 ёшга этгунча", "Туғилганидан то ўлимигачат", "19 ёшга тўлиши билан", "7 ёшдан 70 ёшгача"],
    answer: 2
  },
  {
    text: "Қуйидагилардан қайси бири тўғри?",
    options: ["Барча фуқаролар муомала лаёқатига эга",
       "Фуқаронинг ўз ҳаракатлари билан фуқаролик ҳуқуқларига эга бўлиш ва уларни амалга ошириш, ўзи учун фуқаролик бурчларини вужудга келтириш ва уларни бажариш лаёқати инсоннинг туғилиши билан пайдо бўлади", "Фуқаронинг фуқаролик ҳуқуқ ва бурчларига эга бўлиш лаёқати муомала лаёқати ҳисобланади",
       "Фуқаронинг ўз ҳаракатлари билан фуқаролик ҳуқуқларига эга бўлиш ва уларни амалга ошириш, ўзи учун фуқаролик бурчларини вужудга келтириш ва уларни бажариш лаёқати муомала лаёқати ҳисобланади"],
    answer: 4
  },
 
];
